### I. import and read a CSV file

In [2]:
import pandas as pd
data = pd.read_csv("C:/Users/kknat/OneDrive/Desktop/DATASETS/DataFrames_Dataset_4thQuestion.csv")

### II. To Generate a basic understanding of a given data.

In [3]:
# a. Print First 5 rows, last 5 rows of data 
print("First 5 rows of data : \n",data.head())
print("Last 5 rows of data  : \n",data.tail())

First 5 rows of data :
    customer_id  year_of_birth  educational_level marital_status  \
0     20201701            1982        Graduation         Single
1     20201702            1950        Graduation        Married
2     20201703            1965        Graduation       Divorced
3     20201704            1984        Graduation   Relationship
4     20201705            1981               PhD        Widowed

   annual_income purhcase_date  recency  online_purchases  store_purchases  \
0        58138.0    09-04-2012       58                 8                4
1        46344.0    03-08-2014       38                 1                2
2        71613.0     8/21/2013       26                 8               10
3        26646.0    02-10-2014       26                 2                4
4        58293.0     1/19/2014       94                 5                6

   complaints  calls  intercoms
0           0      3         11
1           0      3         11
2           0      3         11
3           0      3         11
4           0      3         11
Last 5 rows of data  :
      customer_id  year_of_birth  educational_level marital_status  \
494     20202195            1944               PhD       Divorced
495     20202196            1962            Master       Divorced
496     20202197            1978        Graduation       Divorced
497     20202198            1971               PhD   Relationship
498     20202199            1949               PhD   Relationship

     annual_income purhcase_date  recency  online_purchases  store_purchases  \
494        55614.0    11/27/2013       85                 9                6
495        59432.0     4/13/2013       88                 5               11
496        55563.0    04-05-2014       22                 2                3
497        43624.0     4/21/2013       83                 4                4
498        41461.0     5/22/2014       63                 6               11

     complaints  calls  intercoms
494           0      3         11
495           0      3         11
496           0      3         11
497           0      6         11
498           0      6         11

In [5]:
# b. Check the basic information of the data
print("basic information of the data : ")
data.info()

basic information of the data :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499 entries, 0 to 498
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        499 non-null    int64
 1   year_of_birth      499 non-null    int64
 2   educational_level  499 non-null    object
 3   marital_status     499 non-null    object
 4   annual_income      486 non-null    float64
 5   purhcase_date      499 non-null    object
 6   recency            499 non-null    int64
 7   online_purchases   499 non-null    int64
 8   store_purchases    499 non-null    int64
 9   complaints         499 non-null    int64
 10  calls              499 non-null    int64
 11  intercoms          499 non-null    int64
dtypes: float64(1), int64(8), object(3)
memory usage: 46.9+ KB

In [6]:
# c. Extract the shape of the data
print("shape of data : ",data.shape)

shape of data :  (499, 12)

In [7]:
# d. Print the unique values of the marital status field based on the column 
print("the unique values of the marital status field are :\n",data['marital_status'].unique())

the unique values of the marital status field are :
 ['Single' 'Married' 'Divorced' 'Relationship' 'Widowed' 'Widow']

In [8]:
# e. To make it consistent data( widow and widowed )are two different naming for the same category on the column values
data.replace('Widowed','Widow',inplace=True)

In [17]:
# f. Check for duplicates and null values in the whole dataset
print("duplicates in the dataset : ",data.duplicated().sum())
print("null values : ",data.isnull().sum().sum())

duplicates in the dataset :  0
null values :  13

### III. select and filter data based on conditions

In [18]:
# a. Select a subset of the data points(Birthdate, Education, and Income of every customer) from the data frame.
print("subset of the data points(Birthdate, Education, and Income of every customer) : \n")
print(data.sample(n = 10).loc[:,['year_of_birth ','educational_level','annual_income']])

subset of the data points(Birthdate, Education, and Income of every customer) :

     year_of_birth  educational_level  annual_income
162            1982        Graduation        23228.0
155            1985        Graduation        69372.0
169            1984        Graduation        68247.0
428            1989       High School        26116.0
356            1955        Graduation        85503.0
231            1999       High School        81975.0
201            1987        Graduation        75922.0
249            1994            Master        65176.0
239            1984       High School        74960.0
366            1975        Graduation        79530.0

In [123]:
# b. Using loc() and iloc() methods to retrieve the first seven data points.
print("using loc() method : \n",data.loc[:7,:])
print("using iloc() method : \n",data.loc[:7,:])

using loc() method :
    customer_id  year_of_birth  educational_level marital_status  \
0     20201701            1982        Graduation         Single
1     20201702            1950        Graduation        Married
2     20201703            1965        Graduation       Divorced
3     20201704            1984        Graduation   Relationship
4     20201705            1981               PhD          Widow
5     20201706            1967            Master   Relationship
6     20201707            1971        Graduation       Divorced
7     20201708            1985               PhD        Married

   annual_income purhcase_date  recency  online_purchases  store_purchases  \
0        58138.0    09-04-2012       58                 8                4
1        46344.0    03-08-2014       38                 1                2
2        71613.0     8/21/2013       26                 8               10
3        26646.0    02-10-2014       26                 2                4
4        58293.0     1/19/2014       94                 5                6
5        62000.0    09-09-2013       16                 6               10
6        55635.0    11/13/2012       34                 7                7
7        33454.0    05-08-2013       32                 4                4

   complaints  calls  intercoms
0           0      3         11
1           0      3         11
2           0      3         11
3           0      3         11
4           0      3         11
5           5      3         11
6           0      3         11
7           0      3         11
using iloc() method :
    customer_id  year_of_birth  educational_level marital_status  \
0     20201701            1982        Graduation         Single
1     20201702            1950        Graduation        Married
2     20201703            1965        Graduation       Divorced
3     20201704            1984        Graduation   Relationship
4     20201705            1981               PhD          Widow
5     20201706            1967            Master   Relationship
6     20201707            1971        Graduation       Divorced
7     20201708            1985               PhD        Married

   annual_income purhcase_date  recency  online_purchases  store_purchases  \
0        58138.0    09-04-2012       58                 8                4
1        46344.0    03-08-2014       38                 1                2
2        71613.0     8/21/2013       26                 8               10
3        26646.0    02-10-2014       26                 2                4
4        58293.0     1/19/2014       94                 5                6
5        62000.0    09-09-2013       16                 6               10
6        55635.0    11/13/2012       34                 7                7
7        33454.0    05-08-2013       32                 4                4

   complaints  calls  intercoms
0           0      3         11
1           0      3         11
2           0      3         11
3           0      3         11
4           0      3         11
5           5      3         11
6           0      3         11
7           0      3         11

In [19]:
# c. Filter data using the loc() and isin() methods.(Note:we choose the variable of interest and we select the categories )
category = ['High School','Graduation']
print("category : ",category)
data.loc[data['educational_level'].isin(category)]

category :  ['High School', 'Graduation']

,customer_id,year_of_birth,educational_level,marital_status,annual_income,purhcase_date,recency,online_purchases,store_purchases,complaints,calls,intercoms
0,20201701,1982,Graduation,Single,58138.0,09-04-2012,58,8,4,0,3,11
1,20201702,1950,Graduation,Married,46344.0,03-08-2014,38,1,2,0,3,11
2,20201703,1965,Graduation,Divorced,71613.0,8/21/2013,26,8,10,0,3,11
3,20201704,1984,Graduation,Relationship,26646.0,02-10-2014,26,2,4,0,3,11
6,20201707,1971,Graduation,Divorced,55635.0,11/13/2012,34,7,7,0,3,11
...,...,...,...,...,...,...,...,...,...,...,...,...
488,20202189,1969,Graduation,Married,14045.0,1/26/2014,24,1,3,0,3,11
489,20202190,1952,High School,Widow,28457.0,10/28/2012,96,4,4,0,3,11
491,20202192,1976,Graduation,Divorced,46310.0,12-03-2012,99,6,5,0,3,11
492,20202193,1955,Graduation,Relationship,23018.0,2/22/2013,72,3,13,0,3,11
496,20202197,1978,Graduation,Divorced,55563.0,04-05-2014,22,2,3,0,3,11

In [20]:
# d. In our data, that satisfies two conditions such as choosing the customers with an income higher than 75,000 and 
# with a master’s degree(using python operators) and display the output.
print("data that satisfies both conditions is : \n",data.loc[(data["annual_income"] > 75000) & (data["educational_level"]) == "Master"])

data that satisfies both conditions is :
 Empty DataFrame
Columns: [customer_id, year_of_birth , educational_level, marital_status, annual_income, purhcase_date, recency, online_purchases, store_purchases, complaints, calls, intercoms]
Index: []

### IV. apply various data operation tools such as creating new variables or changing data types We can apply different operations on the dataset using Pandas such as

In [21]:
# a. setting a new index with the variable of our interest using the .set_index() method
data.set_index('customer_id',inplace = True)

In [22]:
# b. sorting the data frame by one of the variable using .sort_values() with ascending or descending order;
data.sort_values(ascending = True,by = 'year_of_birth ',inplace = True)

In [24]:
# c. creating a new variable which could be the result of a mathematical operation such as sum of other variables
# print("created variable is 'total_purchases' and data for total_purchases is : \n")
data['total_purchases'] = data['online_purchases']+data['store_purchases']

In [54]:
# d. changing the datatype of variables into datetime or integer types
data1 = data['purhcase_date']
data1 = data1.map(lambda x:x.replace('-','/') if('-' in x) else x)
data1[data1.str.find('-') != -1]
data['purhcase_date'] = pd.to_datetime(data1)

In [55]:
# e. determining the age based on year of birth
age = 2023-data['year_of_birth ']
print("Age of each person is : \n",age)

Age of each person is :
 customer_id
20202040    124
20201733     83
20202059     80
20201740     80
20202195     79
           ...
20201717     23
20202119     23
20201817     23
20201886     23
20202153     23
Name: year_of_birth , Length: 499, dtype: int64

In [63]:
# f. creating the week date (calendar week and year) from the purchase date
data['week_date'] = data['purhcase_date'].dt.strftime('%U-%Y')
data['week_date']

customer_id
20202040    38-2013
20201733    41-2012
20202059    33-2013
20201740    04-2013
20202195    47-2013
             ...
20201717    52-2012
20202119    07-2013
20201817    03-2014
20201886    49-2012
20202153    41-2013
Name: week_date, Length: 499, dtype: object

### V.	 perform data aggregation using group by and pivot table methods
#### After we created new variables, we can further aggregate  and to analyze data  by groups,

In [175]:
# a.	To apply groupby()method to find the mean of income ,recency,number of web and store  purchases by educational group.

data1 = data.groupby(by = ['educational_level'])
annual_income = data1['annual_income'].mean()
recency = data1['recency'].mean()
web_purchases = data1['online_purchases'].mean()
store_purrchases = (data1['store_purchases']).mean()
print("Annual_income : \n",annual_income)
print("Recency : \n",recency)
print("Web_purchases : \n",online_purchases)
print("Store_purrchases : \n",store_purrchases)

Annual_income :
 educational_level
Basic          19514.571429
Graduation     51607.827309
High School    44154.717949
Master         51191.700000
PhD            55878.990991
Name: annual_income, dtype: float64
Recency :
 educational_level
Basic          53.571429
Graduation     47.171206
High School    58.400000
Master         45.000000
PhD            49.008772
Name: recency, dtype: float64
Web_purchases :
 educational_level
Basic          1.571429
Graduation     3.887160
High School    3.450000
Master         4.049383
PhD            4.429825
Name: online_purchases, dtype: float64
Store_purrchases :
 educational_level
Basic          2.857143
Graduation     5.840467
High School    4.600000
Master         5.691358
PhD            6.298246
Name: store_purchases, dtype: float64

In [189]:
# b.	To apply pivot_table()method to find the aggregated sum of purchases  and mean of recency per education and marital status group.
# data1 = data.groupby(by = ['educational_level'])
pt = pd.pivot_table(data,values=('total_purchases','recency'),
                    aggfunc = {'total_purchases':'sum','recency':'mean'},
                   index = ['educational_level','marital_status'])
pt

                                    recency  total_purchases
educational_level marital_status
Basic             Divorced        68.333333               13
                  Relationship    39.333333               15
                  Single          52.000000                3
Graduation        Divorced        54.897959              481
                  Married         42.701493              652
                  Relationship    48.196078              464
                  Single          44.278689              623
                  Widow           48.724138              280
High School       Divorced        64.666667               31
                  Married         66.866667              120
                  Relationship    49.615385               99
                  Single          49.000000               54
                  Widow           66.666667               18
Master            Divorced        60.083333              134
                  Married         50.315789              193
                  Relationship    36.800000              159
                  Single          42.761905              218
                  Widow           37.111111               85
PhD               Divorced        41.350000              232
                  Married         60.000000              236
                  Relationship    43.161290              364
                  Single          49.315789              173
                  Widow           52.250000              218